package cli

import (
	"fmt"
	"io"
)

const banner = `
══════════════════════════════════════════════════════════════════════════════════
 ██╗     ██╗████████╗ ██████╗
 ██║     ██║╚══██╔══╝██╔═══██╗
 ██║     ██║   ██║   ██║   ██║
 ██║     ██║   ██║   ██║   ██║
 ███████╗██║   ██║   ╚██████╔╝
 ╚══════╝╚═╝   ╚═╝    ╚═════╝  v1.2
══════════════════════════════════════════════════════════════════════════════════
CLI-утилита для геоморфологического моделирования береговых систем,
анализа фрактальных свойств береговой линии и моделирования эрозионных процессов
══════════════════════════════════════════════════════════════════════════════════
`

func printBanner(w io.Writer) {
	fmt.Fprint(w, banner)
}
